[
    {
        "recipeName": "Carbonara",
        "recipeImage": "carbonara",
        "recipeDescription": "1) Put a large saucepan of water on to boil.\n\n2) Finely chop the 100g pancetta, having first removed any rind. Finely grate 50g pecorino cheese and 50g parmesan and mix them together.\n\n3) Beat the 3 large eggs in a medium bowl and season with a little freshly grated black pepper. Set everything aside.\n\n4) Add 1 tsp salt to the boiling water, add 350g spaghetti and when the water comes back to the boil, cook at a constant simmer, covered, for 10 minutes or until al dente (just cooked).\n\n5) Squash 2 peeled plump garlic cloves with the blade of a knife, just to bruise it.\n\n6) While the spaghetti is cooking, fry the pancetta with the garlic. Drop 50g unsalted butter into a large frying pan or wok and, as soon as the butter has melted, tip in the pancetta and garlic.\n\n7) Leave to cook on a medium heat for about 5 minutes, stirring often, until the pancetta is golden and crisp. The garlic has now imparted its flavour, so take it out with a slotted spoon and discard.\n\n8) Keep the heat under the pancetta on low. When the pasta is ready, lift it from the water with a pasta fork or tongs and put it in the frying pan with the pancetta. Don’t worry if a little water drops in the pan as well (you want this to happen) and don’t throw the pasta water away yet.\n\n9) Mix most of the cheese in with the eggs, keeping a small handful back for sprinkling over later.\n\n10) Take the pan of spaghetti and pancetta off the heat. Now quickly pour in the eggs and cheese. Using the tongs or a long fork, lift up the spaghetti so it mixes easily with the egg mixture, which thickens but doesn’t scramble, and everything is coated.\n\n11) Add extra pasta cooking water to keep it saucy (several tablespoons should do it). You don’t want it wet, just moist. Season with a little salt, if needed.\n\n12) Use a long-pronged fork to twist the pasta on to the serving plate or bowl. Serve immediately with a little sprinkling of the remaining cheese and a grating of black pepper. If the dish does get a little dry before serving, splash in some more hot pasta water and the glossy sauciness will be revived.",
        "recipeIngredients": "- Pancetta - 100g\n\n- Pecorino cheese - 50g\n\n- Parmesan - 50g\n\n- large eggs - 3 pcs\n\n- Spaghetti - 350g\n\n- Plump garlic cloves - 2 pcs\n\n- Unsalted butter - 2 pcs\n\n- Sea salt and freshly grated black pepper"
    },
    {
        "recipeName": "Breaded Mozzarella",
        "recipeImage": "mozzarella",
        "recipeDescription": "1) Cut the mozzarella into slices about 1 cm high.\n\n2) Pass them in the flour, then in the egg beaten to omelette, with a pinch of salt and finally in the breadcrumbs; press with the palms of the hands to adhere well.\n\n3) Dip the slices of mozzarella in abundant boiling oil, but not steaming; fry them with strong heat on both sides for a few minutes.",
        "recipeIngredients": "- Mozzarella - 400g\n\n- Eggs - 2 pcs\n\n- Breadcrumbs - 100g\n\n- Salt\n\n- Sunflower oil"
    },
    {
        "recipeName": "Fettuccine all'Alfredo",
        "recipeImage": "fettuccine",
        "recipeDescription": "1) Melt the butter in a large saucepan or pan. Add the cream and bring it to a boil. Simmer for 5 minutes, then add the Parmesan cheese, salt and pepper, and turn off the heat under the pan.\n\n2) Bring a large pot of salted water to a boil and boil the fettuccine and drain al dente.\n\n3) Put the cream on low heat, add the pasta and sauté until it is mixed. Serve immediately with grated Parmesan separately.",
        "recipeIngredients": "- Fettuccine - 300g\n\n- Panna - 200ml\n\n- Butter - 50g\n\n- Parmesan - 50g\n\n- Salt - Pepper"
    },
    {
        "recipeName": "Patate alla pescatora",
        "recipeImage": "patate",
        "recipeDescription": "1) Peel the boiled potatoes and cut into cubes.\n\n2) Peel the onion and cut into thin slices, add to the potatoes, adding the tuna drained from the oil and add to the chopped parsley.\n\n3) Season with salt, pepper and oil. Mix well and serve",
        "recipeIngredients": "- Potatoes - 3 pcs\n\n- Onion - 1pc\n\n- Canned Tuna - 1pcs\n\n- Salt - Parsley - Oil"
    },
    {
        "recipeName": "Pizza Margherita",
        "recipeImage": "pizza",
        "recipeDescription": "1) Heat oven to 240C/220C fan/gas 9. Oil a 20 x 24cm baking tray. Mix the flour, yeast, ¼ tsp salt and the sugar in a bowl, then stir in the water. Bring the mixture together, knead until smooth, then press into the oiled tray.\n\n2) Spread passata over the dough, leaving a thin border round the edge. Season the passata, then sprinkle with the chopped basil, the mozzarella and the Parmesan, and bake for 15-20 mins or until cooked through. Scatter with the remaining basil and serve with a side salad.",
        "recipeIngredients": "- Olive oil, for the tray\n\n- Plain flour - 200g\n\n- Packet easy-blend dried yeast - 7g\n\n- Sugar - 1tps\n\n- Warm water - 125ml\n\n- Passata - 85ml\n\n- Mozzarella, half grated, half chopped - 100g\n\n- Grated parmesan - 2 tbsp\n\n- Small bunch basil"
    },
    {
        "recipeName": "Pancakes",
        "recipeImage": "pancakes",
        "recipeDescription": "1) Put 100g plain flour, 2 large eggs, 300ml milk, 1 tbsp sunflower or vegetable oil and a pinch of salt into a bowl or large jug, then whisk to a smooth batter.\n\n2) Set aside for 30 mins to rest if you have time, or start cooking straight away.\n\n3) Set a medium frying pan or crêpe pan over a medium heat and carefully wipe it with some oiled kitchen paper.\n\n4) When hot, cook your pancakes for 1 min on each side until golden, keeping them warm in a low oven as you go.\n\n5) Serve with lemon wedges and caster sugar, or your favourite filling. Once cold, you can layer the pancakes between baking parchment, then wrap in cling film and freeze for up to 2 months.",
        "recipeIngredients": "- Plain flour - 100g\n\n- Large eggs - 2pcs\n\n- Milk - 300g\n\n- Sunflower or vegetable oil, plus a little extra for frying "
    }
]
