[
    {
        "recipeName": "Carbonara",
        "recipeImage": "carbonara",
        "recipeDescription": "1) Cuocete gli spaghetti in acqua bollente e con poco sale. La cottura deve essere al dente.\n\n2) Nel frattempo tagliate a dadini la pancetta o il guanciale di maiale (secondo la tradizione è quest'ultimo che andrebbe utilizzato), lasciando sciogliere in un tegame con un poco di olio.\n\n3) Quando la pancetta o il guanciale appariranno parzialmente sciolti aggiungete un pochino di acqua e cucinare a fuoco moderato per circa 10 minuti.\n\n4) Sbattete in un'insalatiera i quattro tuorli, come per fare una comune frittata, ed aggiungete il pecorino ed un buon pizzico di pepe nero.\n\n5) Versate la pasta scolata in una terrina capiente e aggiungetevi la pancetta o il guanciale preparati con l'unto bollente.\n\n6) Mescolate gli ingredienti delicatamente e unite le uova preparate col formaggio, amalgamandole finchè non risulteranno rapprese e servite la pasta ben calda."
    },
    {
        "recipeName": "Pizza Margherita",
        "recipeImage": "pizza",
        "recipeDescription": "1) Versa la farina su un piano in legno formando una fontana. Fai un buco al centro e riempilo con acqua tiepida, sale e lievito. Impasta in maniera molto energica per circa 15/20 minuti.\n\n2) Quando l’impasto ha raggiunto una consistenza morbida, modellalo in modo da formare una pagnottina e lascialo riposare coprendolo con un canovaccio. L’impasto non deve mai venire a contatto con l’aria esterna. I tempi di riposo sono di circa 3/4 ore a temperatura ambiente.\n\n3) Se non hai molta dimestichezza con gli impasti, puoi renderti conto dell’avvenuta lievitazione controllando le dimensioni del panetto. Se l’impasto appare raddoppiato di volume, la lievitazione è completata.\n\n4) Taglia la mozzarella a dadini e lasciala sgocciolare in uno scolapasta per tutto il tempo di lievitazione dell’impasto. In questo modo, la mozzarella fonde in cottura senza annacquare la pizza.\n\n5) Suddividi l’impasto in sei piccole sfere, disponile su un vassoio spolverato di farina e lasciale riposare coperte da un canovaccio per 45 minuti. Anche in questo caso, la lievitazione è completata quando i singoli panetti raddoppiano di volume.\n\n6) Versa la passata di pomodoro in una ciotola e insaporiscila con un pizzico di sale e un filo di olio d’oliva.\n\n7) Lavora i singoli panetti appiattendoli e stendendoli con le mani. Se non hai ancora acquisito la giusta manualità, usa un matterello. Lo spessore della base dipende dai propri gusti personali. Si consiglia comunque di stenderla fino ad ottenere un disco abbastanza sottile.\n\n8) Prendi il pomodoro con un mestolo, versalo al centro di ogni singolo disco e distribuiscilo in maniera uniforme utilizzando il dorso di un cucchiaio. Completa la farcitura con la mozzarella.\n\n8) Riscalda il forno a 250 gradi e poi inforna per 10 minuti circa. Prima di portare la pizza in tavola, aggiungi un filo d’olio a crudo e guarnisci con il basilico fresco."
    }
]
